In [1]:
#Creating Databases in MySQL
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="#meKRISH30"
)

print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x00000192738007C0>

In [2]:
#cursor for running the MySQL in Python Jupyter Notebook

cursor = mydb.cursor()

In [3]:

cursor.execute('SHOW DATABASES')

for database in cursor:
    print(database)

('abc',)
('business',)
('cantilever',)
('games2win',)
('grofers',)
('information_schema',)
('krish',)
('mysql',)
('performance_schema',)
('pharm_easy',)
('sales',)
('sys',)

In [4]:
# Create a new Database

#sql= "CREATE DATABASE krish"
#cursor.execute(sql)

In [5]:
# -selected database

cursor.execute('use krish')

In [6]:
# Create a new table 

#sql= 'create table BT_Dept (id varchar(5) primary key, name varchar(25), age int(3), sex varchar(1))'
#cursor.execute(sql)

In [7]:
#Show tables

sql= "show tables"
cursor.execute(sql)

for database in cursor:
    print(database)

('bt_dept',)

# ALTER TABLE

* The ALTER TABLE statement is used to add, delete, or modify columns in an existing table.
* The ALTER TABLE statement is also used to add and drop various constraints on an existing table.
#### ALTER TABLE 
* ALTER TABLE TABLE_Name
* MODIFY id varchar(6)
* add column_
* delete column_

In [8]:
# ALTER TABLE
#1.1# Modify a column attribute- (id varchar(5) --> id varchar(6))
"""
sql = 'ALTER TABLE BT_Dept MODIFY id varchar(6)'
cursor.execute(sql)
print(cursor) """

"\nsql = 'ALTER TABLE BT_Dept MODIFY id varchar(6)'\ncursor.execute(sql)\nprint(cursor) "

In [9]:
#1.2 # Add a column attribute
"""
sql = 'ALTER TABLE BT_Dept ADD email varchar(20)'
cursor.execute(sql)

print(cursor) """

"\nsql = 'ALTER TABLE BT_Dept ADD email varchar(20)'\ncursor.execute(sql)\n\nprint(cursor) "

# UPDATE
* The UPDATE statement is used to modify the existing records in a table.
#### UPDATE Syntax
* UPDATE table_name SET column1 = value1, column2 = value2, ... 
* WHERE condition;

Note: Be careful when updating records in a table! Notice the WHERE clause in the UPDATE statement. The WHERE clause specifies which record(s) that should be updated. If you omit the WHERE clause, all records in the table will be updated!

In [10]:
# UPDATE
#1.3 # Update name where id=14BT01

"""
sql= "UPDATE BT_Dept SET name= 'Aafreen Ansari' WHERE id='14BT01' "  
cursor.execute(sql)
mydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.

print(cursor.rowcount, "record inserted.") """

'\nsql= "UPDATE BT_Dept SET name= \'Aafreen Ansari\' WHERE id=\'14BT01\' "  \ncursor.execute(sql)\nmydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.\n\nprint(cursor.rowcount, "record inserted.") '

# DESCRIBE TABLE

In [11]:
#1.4 # Describe a Table

"""
sql = ("DESCRIBE BT_Dept ")
cursor.execute(sql)
"""
#How to print desc table

'\nsql = ("DESCRIBE BT_Dept ")\ncursor.execute(sql)\n'

# INSERT INTO
* The INSERT INTO statement is used to insert new records in a table.
* It is possible to write the INSERT INTO statement in two ways.

#### INSERT INTO Syntax
* INSERT INTO table_name (column1, column2, column3, ...) 
* VALUES (value1, value2, value3, ...);
##### or
* INSERT INTO table_name 
* VALUES (value1, value2, value3, ...);
 
NOTE-If you are adding values for all the columns of the table, you do not need to specify the column names in the SQL query. However, make sure the order of the values is in the same order as the columns in the table. The INSERT INTO syntax would be as follows:

In [12]:
#1.5 #Insert a values in Tables

"""
sql = 'INSERT INTO BT_Dept(id,name,age,sex,email) values(%s, %s, %s, %s, %s)'
val = ('14BT04','Asifa Nasir', '25','F', 'asifa@gmail.com')
cursor.execute(sql,val)
mydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.

print(cursor.rowcount, "record inserted.") """

'\nsql = \'INSERT INTO BT_Dept(id,name,age,sex,email) values(%s, %s, %s, %s, %s)\'\nval = (\'14BT04\',\'Asifa Nasir\', \'25\',\'F\', \'asifa@gmail.com\')\ncursor.execute(sql,val)\nmydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.\n\nprint(cursor.rowcount, "record inserted.") '

In [13]:
#Insert Multiple values in Tables
"""
sql = 'INSERT INTO BT_Dept(id,name,age,sex,email) values(%s, %s, %s, %s, %s)'
val = [
    ('14BT05','Asish Mondal', '26','M', 'asish@gmail.com'),
    ('14BT06','Krish Bhowmick', '26','M', 'krish@gmail.com'),
    ('14BT07','Lopa Mudra', '25','F', 'Lopa@gmail.com'),
    ('14BT08','Mallika Ghosh', '25','F', 'mallika@gmail.com'),
    ('14BT09','Moumita Giri', '25','F', 'moumi@gmail.com')
]
cursor.executemany(sql,val)
mydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.

print(cursor.rowcount, "record inserted.") """

'\nsql = \'INSERT INTO BT_Dept(id,name,age,sex,email) values(%s, %s, %s, %s, %s)\'\nval = [\n    (\'14BT05\',\'Asish Mondal\', \'26\',\'M\', \'asish@gmail.com\'),\n    (\'14BT06\',\'Krish Bhowmick\', \'26\',\'M\', \'krish@gmail.com\'),\n    (\'14BT07\',\'Lopa Mudra\', \'25\',\'F\', \'Lopa@gmail.com\'),\n    (\'14BT08\',\'Mallika Ghosh\', \'25\',\'F\', \'mallika@gmail.com\'),\n    (\'14BT09\',\'Moumita Giri\', \'25\',\'F\', \'moumi@gmail.com\')\n]\ncursor.executemany(sql,val)\nmydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.\n\nprint(cursor.rowcount, "record inserted.") '

In [14]:
# It doesnot make sense
"""
sql = 'INSERT INTO BT_Dept(id,name,age,sex,email) values(%s, %s, %s, %s, %s)'
val = ('14BT10','Mrityunjoy Sarker', '26','M', 'mrity@gmail.com')
cursor.execute(sql,val)
mydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.

print("Last record inserted.", cursor.lastrowid)"""

'\nsql = \'INSERT INTO BT_Dept(id,name,age,sex,email) values(%s, %s, %s, %s, %s)\'\nval = (\'14BT10\',\'Mrityunjoy Sarker\', \'26\',\'M\', \'mrity@gmail.com\')\ncursor.execute(sql,val)\nmydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.\n\nprint("Last record inserted.", cursor.lastrowid)'

# DELETE
* The DELETE statement is used to delete existing records in a table.
#### DELETE Syntax
* DELETE FROM table_name WHERE condition;

Note: Be careful when deleting records in a table! Notice the WHERE clause in the DELETE statement. The WHERE clause specifies which record(s) should be deleted. If you omit the WHERE clause, all records in the table will be deleted!

In [15]:
#1.6 # DELETE

"""
sql= "DELETE FROM BT_Dept WHERE name= 'Lopa Mudra' "  
cursor.execute(sql)
mydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.

print(cursor.rowcount, "record inserted.") """

#It will delete the whole row of data

'\nsql= "DELETE FROM BT_Dept WHERE name= \'Lopa Mudra\' "  \ncursor.execute(sql)\nmydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.\n\nprint(cursor.rowcount, "record inserted.") '

# SELECT
* The SELECT statement is used to select data from a database.
* The data returned is stored in a result table, called the result-set.
#### SELECT Syntax
1. SELECT column1, column2, ... FROM table_name;
2. SELECT * FROM table_name;

In [16]:
#2.1 #SELECT

sql= "SELECT * FROM BT_Dept"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT01', 'Aafreen Ansari', '24', 'F', 'afreen@gmail.com')
('14BT02', 'Arnab Baneerjee', '25', 'M', 'arnaba@gmail.com')
('14BT03', 'Arushi Sinha', '25', 'F', 'arushi@gmail.com')
('14BT04', 'Asifa Nasir', '25', 'F', 'asifa@gmail.com')
('14BT05', 'Asish Mondal', '26', 'M', 'asish@gmail.com')
('14BT06', 'Krish Bhowmick', '26', 'M', 'krish@gmail.com')
('14BT08', 'Mallika Ghosh', '25', 'F', 'mallika@gmail.com')
('14BT09', 'Moumita Giri', '25', 'F', 'moumi@gmail.com')
('14BT10', 'Mrityunjoy Sarker', '26', 'M', 'mrity@gmail.com')

# SELECT DISTINCT- (unique, different,No duplicate value)
* Return the **unique** values for that expression.--->
* The SELECT DISTINCT statement is used to return only distinct (different) values.
* Inside a table, a column often contains many duplicate values; and sometimes you only want to list the different (distinct) values.
#### SELECT DISTINCT Syntax
* SELECT DISTINCT column1, column2, ... 
* FROM table_name;

In [17]:
# DISTINCT
#2.2 #Show me the diff kind of age

sql= "SELECT DISTINCT age FROM bt_dept "
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('24',)
('25',)
('26',)

# WHERE 
* The WHERE clause is used to filter records. It extract only those records that fulfill a specified condition.
#### WHERE Syntax
* SELECT column1, column2, ...
* FROM table_name
* WHERE condition;

In [18]:
# WHERE
#2.3 # how many people's age is 25

sql= "SELECT * FROM bt_dept WHERE age = '25' "
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT02', 'Arnab Baneerjee', '25', 'M', 'arnaba@gmail.com')
('14BT03', 'Arushi Sinha', '25', 'F', 'arushi@gmail.com')
('14BT04', 'Asifa Nasir', '25', 'F', 'asifa@gmail.com')
('14BT08', 'Mallika Ghosh', '25', 'F', 'mallika@gmail.com')
('14BT09', 'Moumita Giri', '25', 'F', 'moumi@gmail.com')

# AND, OR and NOT 
* The WHERE clause can be combined with AND, OR, and NOT operators.
* The AND and OR operators are used to filter records based on more than one condition:
* The AND operator displays a record if all the conditions separated by AND are TRUE --> (Both Condition should True)
* The OR operator displays a record if any of the conditions separated by OR is TRUE --> (Any of Condition True)
* The NOT operator displays a record if the condition(s) is NOT TRUE.
#### AND Syntax
* SELECT column1, column2, ...
* FROM table_name
* WHERE condition1 AND condition2 AND condition3 ...;
#### OR Syntax
* SELECT column1, column2, ...
* FROM table_name
* WHERE condition1 OR condition2 OR condition3 ...;
#### NOT Syntax
* SELECT column1, column2, ...
* FROM table_name
* WHERE NOT condition;

In [19]:
#AND --> Both the condition should True
#2.4 # How many femail are there with 25 age

sql= "SELECT * FROM bt_dept WHERE (age = '25' AND sex = 'F') "
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT03', 'Arushi Sinha', '25', 'F', 'arushi@gmail.com')
('14BT04', 'Asifa Nasir', '25', 'F', 'asifa@gmail.com')
('14BT08', 'Mallika Ghosh', '25', 'F', 'mallika@gmail.com')
('14BT09', 'Moumita Giri', '25', 'F', 'moumi@gmail.com')

In [20]:
# #OR --> Any of the condition True
#

sql= "SELECT * FROM bt_dept WHERE (age = '25' OR sex = 'F') "
cursor.execute(sql)
myresult= cursor.fetchall()  #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT01', 'Aafreen Ansari', '24', 'F', 'afreen@gmail.com')
('14BT02', 'Arnab Baneerjee', '25', 'M', 'arnaba@gmail.com')
('14BT03', 'Arushi Sinha', '25', 'F', 'arushi@gmail.com')
('14BT04', 'Asifa Nasir', '25', 'F', 'asifa@gmail.com')
('14BT08', 'Mallika Ghosh', '25', 'F', 'mallika@gmail.com')
('14BT09', 'Moumita Giri', '25', 'F', 'moumi@gmail.com')

In [21]:
#2 #NOT

sql= "SELECT * FROM bt_dept WHERE NOT (age = '25' OR sex = 'M') "  # use OR & AND see the ans, but why??? 
cursor.execute(sql)
myresult= cursor.fetchall()#fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT01', 'Aafreen Ansari', '24', 'F', 'afreen@gmail.com')

# GROUP BY
* The GROUP BY statement **groups the rows that have the same values into summary rows**, like "find the number of customers in each country".
* It use with aggregate functions (COUNT, MAX, MIN, SUM, AVG) to group the result-set by one or more columns.
#### GROUP BY Syntax
* SELECT column_name(s)
* FROM table_name
* WHERE condition
* GROUP BY column_name(s)
* ORDER BY column_name(s);

In [22]:
# GROUP BY
#2.5 #How many male and female in your class?

sql= "SELECT COUNT(name), sex FROM bt_dept GROUP BY sex   "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(5, 'F')
(4, 'M')

In [23]:
# GROUP BY
#How many male and female in your class?

sql= "SELECT COUNT(name), sex FROM bt_dept GROUP BY sex   "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(5, 'F')
(4, 'M')

# ORDER BY
* The ORDER BY keyword is used to **sort the result-set in ascending or descending order**.
* The ORDER BY keyword sorts the records in ascending order by default. To sort the records in descending order, use the DESC keyword.
#### ORDER BY Syntax
* SELECT column1, column2, ...
* FROM table_name
* ORDER BY column1, column2, ... ASC|DESC;

In [24]:
# ORDER BY
#2.6 #Show me the person's age serial wise

sql= "SELECT * FROM bt_dept ORDER BY age "   
cursor.execute(sql)
myresult= cursor.fetchall()     #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT01', 'Aafreen Ansari', '24', 'F', 'afreen@gmail.com')
('14BT02', 'Arnab Baneerjee', '25', 'M', 'arnaba@gmail.com')
('14BT03', 'Arushi Sinha', '25', 'F', 'arushi@gmail.com')
('14BT04', 'Asifa Nasir', '25', 'F', 'asifa@gmail.com')
('14BT08', 'Mallika Ghosh', '25', 'F', 'mallika@gmail.com')
('14BT09', 'Moumita Giri', '25', 'F', 'moumi@gmail.com')
('14BT05', 'Asish Mondal', '26', 'M', 'asish@gmail.com')
('14BT06', 'Krish Bhowmick', '26', 'M', 'krish@gmail.com')
('14BT10', 'Mrityunjoy Sarker', '26', 'M', 'mrity@gmail.com')

In [25]:
# ORDER BY
# 

sql= "SELECT * FROM bt_dept WHERE (age='25' AND sex='F') ORDER BY name DESC "   
cursor.execute(sql)
myresult= cursor.fetchall()     #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT09', 'Moumita Giri', '25', 'F', 'moumi@gmail.com')
('14BT08', 'Mallika Ghosh', '25', 'F', 'mallika@gmail.com')
('14BT04', 'Asifa Nasir', '25', 'F', 'asifa@gmail.com')
('14BT03', 'Arushi Sinha', '25', 'F', 'arushi@gmail.com')

# MySQL Aggregate Functions : SUM, AVG, MAX, MIN , COUNT, DISTINCT

Aggregate Functions are all about- 
**Performing  calculations on multiple rows Of a single column of a table And returning a single value**.

The ISO standard defines five (5) aggregate functions namely
* 1) COUNT-The COUNT() function returns the number of rows that matches a specified criterion.
* 2) SUM-  The SUM() function returns the total sum of a numeric column.
* 3) AVG-  The AVG() function returns the average value of a numeric column.
* 4) MIN-  The MIN() function returns the smallest value of the selected column.
* 5) MAX-  The MAX() function returns the largest value of the selected column.
#### COUNT() Syntax
* SELECT COUNT(column_name)
* FROM table_name
* WHERE condition;
#### AVG() Syntax
* SELECT AVG(column_name)
* FROM table_name
* WHERE condition;
#### SUM() Syntax
* SELECT SUM(column_name)
* FROM table_name
* WHERE condition;
#### MIN() Syntax
* SELECT MIN(column_name)
* FROM table_name
* WHERE condition;
#### MAX() Syntax
* SELECT MAX(column_name)
* FROM table_name
* WHERE condition;

In [26]:
# MINIMUM
#2.7 # Tell me the details of the female, whose age is minimum

sql= "SELECT MIN(age) FROM bt_dept WHERE sex ='F' "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('24',)

In [27]:
# MAXIMUM
# # Tell me the details of the male, whose age is minimum

sql= "SELECT MAX(age) FROM bt_dept WHERE sex ='F' "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('25',)

In [28]:
# COUNT
# #Tell me how many female are there in class

sql= "SELECT COUNT(sex) FROM bt_dept WHERE sex ='F' "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(5,)

In [29]:
# AVERAGE
# #Tell me the avg age of female

sql= "SELECT AVG(age) FROM bt_dept WHERE sex ='F' "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(24.8,)

In [30]:
# SUM
# #Tell me the sum of all age

sql= "SELECT SUM(age) FROM bt_dept WHERE sex ='F' "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(124.0,)

# NULL Value

* A field with a NULL value is a field with no value.
* If a field in a table is optional, it is possible to insert a new record or update a record without adding a value to this field. Then, the field will be saved with a NULL value.
### How to Test for NULL Values?
* It is not possible to test for NULL values with comparison operators, such as =, <, or <>.
* We will have to use the IS NULL and IS NOT NULL operators instead.
#### IS NULL Syntex
*  SELECT column_names 
* FROM table_name 
* WHERE column_name IS NULL;
#### IS NOT NULL Syntex
* SELECT column_names 
* FROM table_name 
* WHERE column_name IS NOT NULL;

Note: A NULL value is different from a zero value or a field that contains spaces. A field with a NULL value is one that has been left blank during record creation!

In [31]:
# NULL VALUE
#2.8 # tell me where age is given null

sql= "SELECT age FROM bt_dept WHERE age IS NULL "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

# It doesnot show any output because There is no null value in Dataset

In [32]:
# NOT NULL
# 

sql= "SELECT age FROM bt_dept WHERE age IS NOT NULL "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('24',)
('25',)
('25',)
('25',)
('26',)
('26',)
('25',)
('25',)
('26',)

# LIMIT(MySQL) / TOP(MS SQL Server)
* The SELECT TOP clause is used to **specify the number of records to return**.
#### LIMIT Syntax
* SELECT column_name(s)
* FROM table_name
* WHERE condition
* LIMIT number;

In [33]:
#2.9 #BETWEEN & LIMIT
#
sql= "SELECT * FROM bt_dept WHERE age BETWEEN 20 and 24 LIMIT 3 "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT01', 'Aafreen Ansari', '24', 'F', 'afreen@gmail.com')

# SQL Wildcard Characters
* **A wildcard is a character that used to substitute one or more characters in a string when searching in database**.
* **Wildcard characters are used with the LIKE operator. The LIKE operator is used in a WHERE clause to search for a specified pattern in a column**.
##  LIKE Operator--(String Processing)
* The LIKE operator is used in a WHERE clause to search for a specified pattern in a column.
* There are two wildcards often used in conjunction with the LIKE operator:
* * PercentSign(%) represents zero, one, or multiple characters
* * underscore(_) represents a single character
* * LIKE 'a%'	-- start with "a"
* * LIKE '%a'	-- end with "a"
* * LIKE '%or%'	-- have "or" in any position
* * LIKE '_r%'	-- have "r" in the second position
* * LIKE 'a_%'	-- start with "a" and are at least 2 characters in length
* * LIKE 'a__%'	-- start with "a" and are at least 3 characters in length
* * LIKE 'a%o'	-- start with "a" and ends with "o"

#### SYNTEX
* SELECT column_name(s)
* FROM Table_Name
* WHERE column_name LIKE 'a%'

In [34]:
#2.10 #LIKE

sql= "SELECT * FROM bt_dept WHERE name LIKE 'a%'  "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT01', 'Aafreen Ansari', '24', 'F', 'afreen@gmail.com')
('14BT02', 'Arnab Baneerjee', '25', 'M', 'arnaba@gmail.com')
('14BT03', 'Arushi Sinha', '25', 'F', 'arushi@gmail.com')
('14BT04', 'Asifa Nasir', '25', 'F', 'asifa@gmail.com')
('14BT05', 'Asish Mondal', '26', 'M', 'asish@gmail.com')

In [35]:
# LIKE

sql= "SELECT * FROM bt_dept WHERE name LIKE '_a%'  "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT01', 'Aafreen Ansari', '24', 'F', 'afreen@gmail.com')
('14BT08', 'Mallika Ghosh', '25', 'F', 'mallika@gmail.com')

# Aliases- (temporary, a false or assumed identity.)
* SQL aliases are used to give a table, or a column in a table, a temporary name.
* Aliases are often used to make column names more readable.
* An alias only exists for the duration of the query.
#### Alias Column Syntax
* SELECT column_name AS alias_name
* FROM table_name;
#### Alias Table Syntax
* SELECT column_name(s)
* FROM table_name AS alias_name;

In [36]:
#2.11 #ALIASES
#

sql= "SELECT id AS RollNo, name,age AS Name FROM bt_dept WHERE age NOT IN (24,26)  "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

#NOTE--> I was expecting a heading, but it's not comming.

('14BT02', 'Arnab Baneerjee', '25')
('14BT03', 'Arushi Sinha', '25')
('14BT04', 'Asifa Nasir', '25')
('14BT08', 'Mallika Ghosh', '25')
('14BT09', 'Moumita Giri', '25')

# BETWEEN 
* The BETWEEN operator selects values within a given range. The values can be numbers, text, or dates.
* The BETWEEN operator is inclusive: begin and end values are included. 
#### BETWEEN Syntax
* SELECT column_name(s)
* FROM table_name
* WHERE column_name BETWEEN value1 AND value2;

# CASE 

##### CSAE_SYNTEX

* SELECT OrderID, Quantity,
* CASE
* *    WHEN Quantity > 30 THEN "The quantity is greater than 30"
* *    WHEN Quantity BETWEEN 30 AND 40 THEN "The quantity is 30"
//  WHEN Quantity>30 AND Quantity<40 THEN "The quantity is 30"
* *    WHEN Quantity < 40 THEN "The quantity is 30"
* *    ELSE "The quantity is under 30"
* END
* FROM OrderDetails;

In [37]:
#2.12 #CASE
#

sql= "select id,name,sex, CASE WHEN age=24 THEN 'Child' WHEN age=25 THEN 'Adult' WHEN age=26 THEN 'Buro' END AS AAA FROM bt_dept"  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT01', 'Aafreen Ansari', 'F', 'Child')
('14BT02', 'Arnab Baneerjee', 'M', 'Adult')
('14BT03', 'Arushi Sinha', 'F', 'Adult')
('14BT04', 'Asifa Nasir', 'F', 'Adult')
('14BT05', 'Asish Mondal', 'M', 'Buro')
('14BT06', 'Krish Bhowmick', 'M', 'Buro')
('14BT08', 'Mallika Ghosh', 'F', 'Adult')
('14BT09', 'Moumita Giri', 'F', 'Adult')
('14BT10', 'Mrityunjoy Sarker', 'M', 'Buro')

# INDEX
* ADVANTAGE-Index is performance-tuning method of allowing faster retrival of records
* DISADVANTAGE-Take time during UPDATE the table

#### INDEX_SYNTEX
* CREATE INDEX index_name
* ON table_name
* index_column_name1, column_name2, column_name3, column_name4
* b-----------l---------a----------n-----------k
* DROP INDEX [IF EXISTS] index_name
* ALTER INDEX [IF EXISTS] index_name

In [38]:
#2.13 #INDEX

# VIEW 
* View is not a physical table, It's a virtual table created by a query joining by one or two table.

#### VIEW_SYNTEX
* CREATE OR REPLACE VIEW view_name AS----- create for new table and replace if the view is already created
* SELECT column(s)
* FROM table_name
* WHERE condition;
* b--------------l------------a-------------n--------------k
* SELECT * FROM view_name-----------------# to see the view table
* DROP VIEW view_name---------------------# Delete the view table

##### NOTE-- We_Can_Update_ViewTable_But_The_Original_Table_Also_Update

In [39]:
#2.14 #

# CTE- CommonTableExpression